[{"review_rating": 5.0, "review_content": "[u\"I always walk/drive/cable ride by this place and finally got to try it today. I may have found my new favorite cafe. The food is so fresh and healthy. The shrimp was really good quality. I'm so excited to return.\", u\"Update: Finally deciding to post this review as I originally wrote it on my phone so could not. Since my first visit about 3 months ago, I've been back numerous times and I tried so many more items. Highly recommend the shrimp and grapefruit salad that I tried the first time. It's my favorite. Others are the Salmon and Creme Fraiche, procuttio sandwich, and tomato and mozzarella. Also, I was really impressed with their mocha. Usually, I think mocha's just taste like chocolate milk, but their's maintains a good coffee taste, but not quite like a latte. \", u'I adore you Nook! x3']"},
{"review_rating": 4.0, "review_content": "[u\"I've walked by this spot a few times and always assumed it to be a wine bar. Finally stopped in here one afternoon and was surprised to find the atmosphere more like a cafe, with a full menu of delicious eats!\", u'So many great things about Nook, starting with its outdoor seating. For some reason this is harder to find than it should be in this area.', u'Um, also they have daily happy hour from 5-7pm with glasses of wine wine going for $3.50 and cocktails for $4. En serio.', u\"Don't mind the constant hum of cable cars beneath your feet; it just adds to Nook's allure. (Though if you're easily distracted, that means you probably shouldn't settle down here for a day to study or do work.) \", u\"Will have to come back to try the pita pizza (chicken, pesto, tomatoes and fontina cheese, I'm looking at you!) and the sandwiches (which include combos like avocado, tomato, cucumber, sprouts, red onions & dijon mustard on ciabatta bread, yummm). Thanks for being in my neighborhood, Nook!\"]"},
{"review_rating": 4.0, "review_content": "[u'Cosy, welcoming and casual. ', u\"We initially popped in for the happy hour ($3.75 per delicious glass of red) and ended up getting a couple of pita pizzas and a huge chef's salad to share - delicious and great value. \", u'The staff also had good taste in music. Would happily return!']"},
{"review_rating": 4.0, "review_content": "[u'Cozy little place to catch a warm breakfast and drink and catch up on email.', u'Quality drinks, nice service, warm atmosphere.', u'ahh... :)']"},
{"review_rating": 4.0, "review_content": "[u\"The little crook of my lover's shoulder is where I want to be when I'm in need of comfort.\", u'Nook is like that.', u'Whether you need tea to soothe you, a cafe americano to wake you up or some wine to relax, this cozy spot on Hyde and Jackson has something for everyone. Mostly neighborhood folks frequent the place and some laptoppers busily getting work done, Nook is intimate, simple and immediately can feel like home. Factor in the occasional passing by of the lovely cable car outside and you\\'re going to smile to yourself and say, \"there is no place like San Francisco!\" ', u'Heart.']"},
{"review_rating": 5.0, "review_content": "[u'Great place to meet a friend or go by yourself. ', u'Coffee, and breakfast has always been great.', u\"Happy hour sangria can't be beat.\"]"},
{"review_rating": 4.0, "review_content": "[u\"Nook is one of several wine bars on Hyde, and a cute cafe to grab a salad or sandwich, or latte and pastry. Portions are sizable and good for lunch. The prawn/avocado/grapefruit salad is really good, as is the turkey/brief/cranberry sandwich. They have happy hour every day (including weekends) from 4-7pm which offers super cheap wine, beer, cocktails, and sangria. Nook has free wifi too, although make sure you're sitting at a laptop-friendly table when using it. And don't look for wifi on weekends. It's turned off.\"]"},
{"review_rating": 1.0, "review_content": "[u'This rating is for their sangria only.', u'I came here once to try a new sangria place. I bought a pitcher with a friend. It tasted very watered down. It tasted plain and no fruit taste. Waste of money. ', u'Great little cafe ambiance. Stay indoors because the line from the cable cars is annoying and loud when sitting outside.']"},
{"review_rating": 5.0, "review_content": "[u'My go-to for Russian Hill']"},
{"review_rating": 5.0, "review_content": "[u\"Love this place. We live three doors down and it's saved us from an empty fridge, broken ComCast wifi nightmares, or just the desire for a good glass of reasonably priced red wine.\", u\"If you're new to the city, an early morning coffee sat outside watching the cable cars go past is a lovely way to start the day.\", u\"If you're not new to this city and can't face the scene in the Bell Tower (which is also awesome) this place is far more chilled.\"]"},
{"review_rating": 5.0, "review_content": "[u\"I love this place. Everything I've ordered is so delicious and fresh. Sometimes they offer vegan German chocolate cake, and it's so delicious paired with a cup of coffee. I love the option of sitting outside to eat and enjoy a glass of wine on a beautiful day or to sit indoors on a charming wooden bench, in close proximity to others. April and Josh, along with a few others behind the counter, are always so friendly and chill. They recognize repeat visitors and go out of their way to acknowledge them and say hello. It's like going to a clean, cafe version of Cheer's.\"]"},
{"review_rating": 4.0, "review_content": "[u'Adorable! Amazing cappuccino that kept me alert for ever. Within walking distance to shops/ yoga studios- whatever. And there are cable cars that pass by about every 15 minutes! (Part of the SF charm) I got the cheese & fig jam plate which was good after walking around the city all day. Could only get through about a third of it though, the portion was pretty large. My only slight complaint was that as the sun went down it got aggressively dark in there. Turn on a light perhaps? Your call.']"},
{"review_rating": 4.0, "review_content": "[u\"Love this place. It's always such a good go-to place that I've been going to for a few years now. I used to live on Jackson and Van Ness, so it was only about 5 blocks away. My girlfriends and I would sometimes go on Saturday mornings and get the bottomless mimosa special (only $12.50) along with entrees and get sufficiently drunk! They have tons of things on the menu, ranging from sandwiches to salads to wraps to specials, such as quiche, so you can definitely find something for you. Everything I've always had has been amazing, and the best part is, most entrees are less than $10. I'm a big quiche fan and have repeatedly gotten their quiche of the day, which is usually a veggie one. Yesterday, they had a delicious broccoli/pesto quiche that was to die for. My friend got the chicken pesto sandwich, another winner. \", u\"The Nook's name truly defines its interior. It's small and cozy, and the staff is super nice. They have lots of soju cocktails and other beverages too. Fantastic go-to place, you can't go wrong with it.\"]"},
{"review_rating": 4.0, "review_content": "[u\"This isn't a reading device. It's an actual nook -- in the traditional sense. Situated quaintly at the corner of Hyde Street and Jackson where Russian Hill welcomes Nob Hill. \", u\"For a small caf\\xe9, that caters to the lone reader, old pals chatting, lovers snuggling and smiling or uni students typing away, Nook's menu is long and varied with vegetarian quiches, bagels, waffles, vegan edibles like a tamale pie, lasagna, pita pizzas, empanadas, soups, sandwiches and salads with arugula. Eruca Sativa. Or roka, in Turkish -- I remember scouting for them amongst fields as a teenage girl in Turkey. Pungent, light, lemony and nourishing. A salad with roka is a serious salad.\", u'Nook is perfect for starting your day with granola with milk, yogurt and fresh fruit ($6.75) or \\xa0oatmeal with raisins, brown sugar and milk ($4.75), you can add on strawberries and bananas or a mixed fruit bowl ($5.50), scrambled eggs with toast ($6.50), or breakfast wraps ($6.95-7.95). ', u'Lunchtime and beyond, Nook offers all of the above minus omelets and waffles, plus small plates like tomatoes with fresh mozzarella and pesto ($7.95), artichoke bottoms filled with goat cheese wrappped in prosciutto di parma and a topping of pesto sauce ($8.00), hummus, olive tapenade, cucumber, tomatoes with pita ($7.95), smoked salmon, cr\\xe8me fra\\xeeche, chives and lemon juice on whole wheat crostini ($8.00), three cheeses and fig spread on a walnut bread ($9.00), or shrimp quesadilla with avocado and salsa ($8.50).', u\"The menu doesn't skimp on drinks, either. Nook is a wine bar, too, after all. In addition to wine, summer Monday's invite sangria drinkers to it's cherry wood tables for two or four. \", u\"For the classic wine sobremesa, Nook's selection includes: \", u'*Italian Lamarca ($6.50-$22.00)', u'*Ros\\xe9 Regale, Pinot Gris ($7.00-$28.00)', u'*Riesling from Monterey ($7.50-$30.00)', u'*Chardonnay from San Luis Obispo ($8.00-$32.00)', u'*French Chateau du Campuget, Ros\\xe9 ($8.00-$32.00)', u'*Spanish Martin Codax Albarino ($8.00-$32.00)', u'*Ergo Tempranillo from Spain ($7.50-$28.00)', u'*Gascon Melbec from Argentina ($7.50-$28.00)', u'*Merlot from Chile ($7.75-$30.00)', u'*Cabernet Sauvignon from Sonoma ($8.00-$32.00)', u'*Tuscan Chianti ($15.00)', u'*Zinfandel from Sonoma ($18.00)', u'*Shiraz Cabernet from Southern Australia ($16.00)', u'... among many others. ', u'Other libations of merit include sake and soju cocktails, mimosas, bellinis, piping hot coffees, caf\\xe9 au lait ($1.75-$2.65), espresso ($1.80-$2.75), cappuccino ($2.75), hot chocolate ($2.75-$3.25), a rejuvenating mug of tea ($2.00), or chai tea ($2.95-$3.50). All caffeinated beverages are also offered decaf, if you so wish.', u\"Nook's strength is it's simple, easy breezy ambiance, surrounded by large-pane windows for people-watching or to be watched by the passing cable car patrons or sun-soaking, and of course, a menu that celebrates vegan, vegetarian, gluten-free, organic, sustainable and locally produced edibles. \", u'Pro-tips:', u'* No wi-fi on weekends or holidays. Wi-Fi passwords are only available Monday through Friday, 7a-5p. ', u'* Happy Hour is daily from 5p-7p.']"},
{"review_rating": 5.0, "review_content": "[u\"Great for midweek coffee and sandwiches with good internet and nice light airy environment. Quite peaceful (except for the cable cars running by, which you don't notice too often to be honest) with nice background music. Coffee is great, sandwiches are better.\", u\"Also great for an inexpensive brunch on the weekend. Bottomless mimosas are $12.50 but aren't very strong. Some outdoor seating too (some in the sun and some in shade) which can be nice on a Saturday morning.\", u'Staff are nice and friendly too.']"},
{"review_rating": 4.0, "review_content": "[u'Great place for a late breakfast or brunch, the food is great and their coffee is even better!! The staff is super friendly. The only down side is that when you order a coffee and something to eat, you will finish your coffee or it will get cold before you get your food. The location is great and the cable cart stops right in front... A very good place to stop and relax.']"},
{"review_rating": 1.0, "review_content": "[u'I was excited to try Nook after reading all of the great reviews, however my experience was not good at all. Got to the counter to order and waited probably 3 minutes until someone acknowledged me. There was a man making a latte right in front of methat could have easily said, \"I will be with you shortly\" but no. ', u'Once I was finally able to put in my order, I felt uncomfortable and not welcomed. The man taking my order was rude and cold.', u'After I went up to the counter to receive my breakfast bagel, I noticed they put ham on it instead of bacon . I told him that I had asked for bacon and he said it will be a while until he can fix it. Ummm are you serious!? No apology or \"let me fix this for you.\" ', u'After spending $12 on not fresh orange juice and a breakfast bagel, I will never return to Nook or give them my business again.']"},
{"review_rating": 5.0, "review_content": "[u'Nice location, walking distance to everything. \\xa0Huge selection of sandwiches and salads, coffee, and drinks, not to mention the excellent happy hour prices! \\xa0My new go-to spot in the city.']"},
{"review_rating": 4.0, "review_content": "[u'Oh how I love a cute little wine bar, and this place fits the bill. \\xa0Great happy hour deals - a perfect little place to grab some cheap wine, a hummus platter, and catch up with your husband/wife and/or friends. \\xa0', u'We live in the neighborhood, so my husband and I will most hit this place up quite a bit.']"},
{"review_rating": 3.0, "review_content": "[u\"One of our first stops while in San Fran and heading towards the wharf. \\xa0Cute and small with a nice big menu. \\xa0We didn't try any food just stopped in for a beer and a rest on their sidewalk tables before continuing to take on the hills. \\xa0Tables and chairs outside are a little rickety but otherwise it has a nice vibe and friendly counter people.\"]"},
{"review_rating": 4.0, "review_content": "[u'Came here for coffee and breakfast on a Sunday. Couple things to offer the world of Yelpers: ', u\"1. Don't come here in a hurry for food. You want pastries and a cup of coffee? You're fine. You want breakfast and you want it now? Better go elsewhere, the wait for food was a bit long.\", u\"2. No WiFi on the weekends seems to mean it's pretty easy to grab a table. This was great!\", u\"3. Espresso and brewed coffee got the job done. Oatmeal with berries wasn't particularly noteworthy, but also fulfilled it's role as a foodstuff. \", u'4. Counter staff were super friendly. ', u'7/10, would go again in a pinch or if I really wanted to sip a cup of coffee and sit in the sun. Curious how they perform as a wine bar!']"},
{"review_rating": 4.0, "review_content": "[u\"If you're looking for a cosy place to snuggle up in the corner with a nice cup of coffee and your laptop (free wifi) then look no further! Nook is a lovely little cafe in the heart of Russian Hill. The ambience is always pleasant. On a rainy day this cafe will make you feel warm and cosy. The big windows overlook the beautiful tree-lined Hyde St and the occasional cable car will run past. A good cafe for visitors to town who want a taste of everyday life in SF. \\xa0Good food, coffee and reasonably priced.\"]"},
{"review_rating": 2.0, "review_content": "[u\"This place kind of sucks. Took over a half an hour to get our 2 chicken pesto sandwiches made. When they did come they were on two different kinds of bread, and one of them was still cold in the middle. Prices were ok, but that's about it.\"]"},
{"review_rating": 4.0, "review_content": "[u\"This is a nice, cozy, little wine bar/cafe. \\xa0During the weekday you feel as though you are being disruptive since majority of people in there were quietly working away on their laptops. Well, at least that's how my husband and I felt when we came in to grab a quick bite. \", u'We sat outside and watched as the cable cars pass by. I had a pesto, tomato, mozzarella sandwich on ciabatta bread. It was satisfying and the hubs had an avocado, chutney sandwich which he liked just as equally. ', u\"The staff apparently don't mind that those on the laptops hang out all day to take advantage of the free wifi, well given that you've made some kind of purchase here. If I lived in the neighborhood I would probably do the same.\"]"},
{"review_rating": 4.0, "review_content": "[u'Yummy small plates - the hummus plate was perfect for 2 to share. Really fun to sit outside and watch the cable cars go by with a pitcher of sangria. Also a fairly quiet place to work during the week with a cup of coffee.']"},
{"review_rating": 5.0, "review_content": "[u\"Nice neighborhood cafe. I am a fan of the house coffee and love the chicken pesto artichoke and fontina cheese on whole wheat baguette! The breakfast wrap is wholesome but there isn't a huge amount of flavor for me.\", u'Salads are great but the small plates are my favorite. Shrimp quesadilla!? Prosciutto wrapped around artichoke hearts and goat cheese toasted up is super delicious.', u\"A bit pricey, but it's San Francisco and it's solid. I feel fortunate to have that place and u-lee right next to each other for the variety.\"]"},
{"review_rating": 2.0, "review_content": "[u'Super cute place with decent food and coffee. Reason for low stars: they lie about having real maple syrup for the waffle. Not cool. Just tell the truth. Now I wonder - what else are they lying about?']"},
{"review_rating": 4.0, "review_content": "[u\"Cute little coffee shop with wi-fi (only on weekdays until 6p). \\xa0Weird how it's only on weekdays, but it's their business so they make the rules. \\xa0Nice place to meet a friend for a latte or a pastry. \\xa0Not good for groups because it's super tiny! \\xa0Great mom & pop shop.\"]"},
{"review_rating": 4.0, "review_content": "[u\"While waiting for a friend at Jackson and Hyde I showed up 30 minutes earlier than anticipated. My stomach reminded me it was hungry. I decided to take the opportunity to grab something to eat. Nook Just happened to be here like the room of requirement from Harry Potter. It was a great stop. The atmosphere is relaxing and the staff are friendly. Their chocolate muffins are moist with good sized chocolate pieces. I'll be back here again-on purpose next time.\"]"},
{"review_rating": 3.0, "review_content": "[u'This place came up under my \"Vegan\" search and it is not a vegan restaurant. Like any place, I\\'m sure they\\'ll have some options or accommodations for vegans, but as a vegan I wouldn\\'t go here for a meal. That said, it is a very cute place for a cup of coffee or some wine.']"},
{"review_rating": 5.0, "review_content": "[u\"I spent many a day here reading and writing when living in SF. They've always got a great group of people working there and the dishes are MUCH better than you'd expect from a cafe that also has wifi. It's a true cafe that offers wifi, not an internet cafe that also has food. \", u\"So don't hate on them for turning off the wifi on the weekends and after 6pm on the weekdays. You can't blame them for not wanting their cute cafe to turn into another internet pantry where people occupy tables for hours and just buy a coffee.\"]"},
{"review_rating": 5.0, "review_content": "[u\"wish I could study here more, but the location is inconvenient for those who don't live here. \\xa0but if you can get here, it's very cozy, reasonably quiet and has quite a few tables, considering how small it is.\", u\"windows are big, so you'll get a good view of the cable cars running up and down hyde. \\xa0you can definitely feel it beneath your feet, but it won't bother you much. \\xa0\", u\"seating gets hard to find around the evening when people come for wine / happy hour, but it's a nice mid-day study spot that has the feel of a caf\\xe9 in the suburbs.\", u\"vanilla soy lattes are $4.75, so.... I guess normal. \\xa0coffee isn't specially brewed or whatever, so it won't spring you awake, but it'll keep you going.\", u\"aside from being a place to study, it's def a lovely location to catch up with a friend or spend a lazy sunday people watching.\"]"},
{"review_rating": 1.0, "review_content": "[u\"I used to like this place. This am I had the worst latte of my 7 years living in SF. To the person who made it (not the gentlemen with the glasses): put a little love in it and take pride in your job. \\xa0I used to be a barista and I know what I'm talking about. Constructive criticism: drink was WAY too hot and lattes come with foam. I was in a rush, otherwise would have gone back. I dumped it and went to another place. Too bad.\"]"},
{"review_rating": 3.0, "review_content": "[u\"This place is just OK. I got a cappuccino that was $3.15 (decent to expensive in price). was mostly foam and not that hot. I'd look elsewhere for a quality coffee if I were you.\"]"},
{"review_rating": 1.0, "review_content": "[u\"Found 2 pieces of hair in my food! So gross..the employees are very rude. So much attitude. I don't think you should treat a paying customer like that. The owner needs to train employees to have customer service & use gloves when making the food--I've never been so grossed out of the lady taking cash and then touching the food. Don't go here!!\"]"},
{"review_rating": 4.0, "review_content": "[u\"I heart Nook! I've been here several times solo for a glass of wine/sangria/mimosa. The happy hour price cannot be beat. It's a small spot with cute outdoor seating available. \\xa0The staff is always really friendly. I've also tried the food which have been great as a casual, filling and affordable meal. Nook is a great spot for holing up with a glass or two.\"]"},
{"review_rating": 4.0, "review_content": "[u\"I am disappointed with myself because I have been going to Nook for 3 years and haven't written a review until now! \", u\"It's the perfect neighborhood hangout. \", u'They have amazing pastries/pies and usually a vegan option as well. Lunch items like salads and sandwiches are on the menu too. ', u'I usually order italian soda but depending on mood I may order wine (they have happy hour!) or a soy latte. All of their drinks are decently good...', u\"Great vibe during the week for working 'from home'. Although only a few outlets along the window bench. Outdoor seating as well.\"]"},
{"review_rating": 4.0, "review_content": "[u'Nook is the best wine bar in \\xa0CA . The bartenders are truly experts in their trade, and are thrilled to help you discover new wines.']"},
{"review_rating": 5.0, "review_content": "[u'This place was amazing! Great service and nice location. Me and my fianc\\xe9 went here Sunday morning for brunch and bottomless mimosas! Never waited to long to get topped off.']"},
{"review_rating": 2.0, "review_content": "[u\"The girlfriend and I were visiting from Sacramento when we came across Nook. Great environment, friendly staff, but the food isn't well balanced. Now, normally I wouldn't care, but when you charge almost 9 dollars for a sandwich, it better be good.\", u'I ordered the Honey Baked Ham with Fontina, Sage and a \\xa0Herb Salad on the side. I felt that the flavor profiles were too unbalanced, the sage was EXTREMELY overpowering of the delicious ham and fontina, it got to a point where it made my mouth almost numb. The bread was delicious, but nothing to ride home about.', u\"The herb salad with the balsamic dressing was good, but once again for the price it just wasn't worth the money.\", u'I feel as though using sage so liberally shows a lack of understanding for taste. It single-handedly ruined the sandwich, because that fontina cheese is oh-so-good.', u\"For a place where the prices are higher, the quality and consistency should be there to match, I will definitely give this place a try again to see how it is because their other foods seemed promising, I'll update this review when I do.\"]"}]